@file:JvmName("uzr")

package com.bogovich

import com.bogovich.utils.AfValidationUtils.validateDocument
import com.bogovich.utils.InsuredPersonUtils
import com.bogovich.xml.writer.dsl.DslXMLStreamWriter
import java.io.BufferedWriter
import java.io.File
import java.io.FileOutputStream
import java.io.OutputStreamWriter
import java.time.LocalDate
import java.util.*
import java.util.zip.GZIPOutputStream
import kotlin.system.measureTimeMillis

val guid = UUID.randomUUID().toString()
val localDate = LocalDate.now().toString()

fun main(args: Array<String>) {
//    val writer = DslXMLStreamWriter(System.out)
//    serialize04(writer)
    val file = File("h:\\ПФР_777000_УЗР_${localDate}_$guid.xml.gz")
    val fileOutputStream = BufferedWriter(OutputStreamWriter(GZIPOutputStream(FileOutputStream(file)), "UTF-8"))
    fileOutputStream.use {
        val writer = DslXMLStreamWriter(it)
        measureTimeMillis {
            serialize04(writer)
        }.let {
            println("Total time $it =  ${it / 1000}s")
        }
    }

    val pathToSchemaFolder = "C:/Users/aleksandr.bogovich/Desktop/uspn/Design&Analysis/Technical Specification/Альбом Форматов/АФ 2.19.2д 17.01.2018/Схемы"
    validateDocument(file, "УЗР", pathToSchemaFolder)
}

private fun serialize04(writer: DslXMLStreamWriter) {
    writer.document {
        "ЭДПФР" {
            defaultNamespace("http://пф.рф/ВсВО/НПФ/УЗР/2017-08-09")
            namespace("ВНПФ", "http://пф.рф/ВсВО/НПФ/типыВходящие/2017-08-09")
            namespace("НПФ", "http://пф.рф/ВсВО/НПФ/типы/2017-08-09")
            namespace("УТ", "http://пф.рф/унифицированныеТипы/2014-01-01")
            namespace("АФ", "http://пф.рф/АФ")

            "УЗР" {
                "НПФ" {
                    "Наименование"("НЕГОСУДАРСТВЕННЫЙ ПЕНСИОННЫЙ ФОНД ПЛЕС")
                    "НаименованиеФормализованное"("НПФ_ПЛЕС")
                    "ИНН"("7881020165")
                    "ОГРН"("1033628801099")
                    "Лицензия" {
                        "УТ:Дата"("2010-08-08")
                        "УТ:Номер"(2308)
                    }
                    "Адрес" {
                        "УТ:Индекс"(127001)
                        "УТ:РоссийскийАдрес" {
                            "УТ:Город" {
                                "УТ:Название"("МОСКВА")
                                "УТ:Сокращение"("г")
                            }
                            "УТ:Улица" {
                                "УТ:Название"("ЛЕСКОВА")
                                "УТ:Сокращение"("ул")
                            }
                            "УТ:Дом" {
                                "УТ:Номер"(2)
                            }
                        }
                    }
                }
                "Реорганизация" {
                    "РешениеБанка" {
                        "УТ:Дата"("2010-10-10")
                        "УТ:Номер"("1010")
                    }
                    "Форма"(1)
                    "Результат" {
                        "Созданные" {
                            "НПФ" {
                                "Наименование"("НЕГОСУДАРСТВЕННЫЙ ПЕНСИОННЫЙ ФОНД ПЛЕС")
                                "ИНН"("7881020165")
                                "ОГРН"("1033628801099")
                                "Адрес" {
                                    "УТ:Индекс"("127001")
                                    "УТ:РоссийскийАдрес" {
                                        "УТ:Город" {
                                            "УТ:Название"("МОСКВА")
                                            "УТ:Сокращение"("г")
                                        }
                                        "УТ:Улица" {
                                            "УТ:Название"("ЛЕСКОВА")
                                            "УТ:Сокращение"("ул")
                                        }
                                        "УТ:Дом" {
                                            "УТ:Номер"(2)
                                        }
                                    }
                                }
                            }
                        }
                        "ПрекратившиеДеятельность" {
                            //1
                            "НПФ" {
                                "Наименование"("НЕГОСУДАРСТВЕННЫЙ ПЕНСИОННЫЙ ФОНД ВОЛОГДА")
                                "ИНН"("7886021717")
                                "ОГРН"("1033628802299")
                                "Адрес" {
                                    "УТ:Индекс"(127001)
                                    "УТ:РоссийскийАдрес"{
                                        "УТ:Город"{
                                            "УТ:Название"("КОСТРОМА")
                                            "УТ:Сокращение"("г")
                                        }
                                        "УТ:Улица" {
                                            "УТ:Название"("ЛЕНИНА")
                                            "УТ:Сокращение"("ул")
                                        }
                                        "УТ:Дом"{
                                            "УТ:Номер"(2)
                                        }
                                    }
                                }
                            }
                            //2
                            "НПФ" {
                                "Наименование"("НЕГОСУДАРСТВЕННЫЙ ПЕНСИОННЫЙ ФОНД СУЗДАЛЬ")
                                "ИНН"("7884038318")
                                "ОГРН"("1033628803399")
                                "Адрес" {
                                    "УТ:Индекс"("")
                                    "УТ:РоссийскийАдрес" {
                                        "УТ:Город"{
                                            "УТ:Название"("РОСТОВ")
                                            "УТ:Сокращение"("г")
                                        }
                                        "УТ:Улица"{
                                            "УТ:Название"("ФРУНЗЕ")
                                            "УТ:Сокращение"("ул")
                                        }
                                        "УТ:Дом"{
                                            "УТ:Номер"(2)
                                        }
                                    }
                                }
                            }
                            //3
                            "НПФ" {
                                "Наименование"("НЕГОСУДАРСТВЕННЫЙ ПЕНСИОННЫЙ ФОНД КОЛОМНА")
                                "ИНН"("7880032954")
                                "ОГРН"("1033628803399")
                                "Адрес" {
                                    "УТ:Индекс"("")
                                    "УТ:РоссийскийАдрес"{
                                        "УТ:Город"{
                                            "УТ:Название"("РОСТОВ")
                                            "УТ:Сокращение"("г")
                                        }
                                        "УТ:Улица" {
                                            "УТ:Название"("ФРУНЗЕ")
                                            "УТ:Сокращение"("ул")
                                        }
                                        "УТ:Дом" {
                                            "УТ:Номер"(22)
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
                var totalZlCount: Long = 0
                "СписокСведений" {
                    "РеорганизованныйНПФ" {
                        var zlCount: Long = 0
                        for (i in 1..5_000/*_000*/) {
                            if (i % 10000 == 0) {
                                println("Write $i")
                            }
                            "Запись" {
                                "НомерПП"(i.toString())
                                "НПФ" {
                                    "Наименование"("НЕГОСУДАРСТВЕННЫЙ ПЕНСИОННЫЙ ФОНД ПЛЕС")
                                    "ОГРН"("1033628801099")
                                    "Лицензия" {
                                        "УТ:Дата"("2010-08-08")
                                        "УТ:Номер"("2308")
                                    }
                                }
                                "ЗЛ" {
                                    "УТ:ФИО" {
                                        "УТ:Фамилия"("ГОЛЬФ")
                                        "УТ:Имя"("ЕКАТЕРИНА")
                                        "УТ:Отчество"("АЛЬФРЕДОВНА")
                                    }
                                    "УТ:ДатаРождения"("1974-05-07")
                                    "УТ:Пол"("Ж")
                                    val s: Long = 81_000_000L + i - 1
                                    zlCount++
                                    "УТ:СтраховойНомер"(InsuredPersonUtils.formattedNumber(s))
                                }
                                "СПН" {
                                    "НПФ:Сумма"(200222)
                                    "НПФ:ИД"(1500)
                                }
                                "Выплаты"(250000)
                            }
                        }
                        totalZlCount += zlCount
                        "КоличествоЗЛ"(zlCount.toString())
                    }
                }
                "КоличествоЗЛ"(totalZlCount.toString())
                "ЕиоНПФ" {
                    "УТ:ФИО" {
                        "УТ:Фамилия"("Сидоров")
                        "УТ:Имя"("Николай")
                        "УТ:Отчество"("Владимирович")
                    }
                    "УТ:Должность"("Генеральный директор")
                }
            }
            "СлужебнаяИнформация" {
                "АФ:GUID"(guid)
                "АФ:ДатаВремя"("2017-08-09T12:00:00-05:00")
                "НПФ:Составитель" {
                    "УТ:НалоговыйНомер" {
                        "УТ:ИНН"("7881020165")
                        "УТ:КПП"("770201001")
                    }
                    "УТ:КодЕГРИП"("0")
                    "УТ:Форма"("normalizedString")
                    "УТ:НаименованиеОрганизации"("НЕГОСУДАРСТВЕННЫЙ ПЕНСИОННЫЙ ФОНД ПЛЕС")
                    "УТ:НаименованиеКраткое"("НПФ_ПЛЕС")
                    "УТ:РегистрационныйНомер"("000-000-000000")
                    "УТ:Адрес" {
                        "УТ:Индекс"("127001")
                        "УТ:РоссийскийАдрес" {
                            "УТ:Город" {
                                "УТ:Название"("МОСКВА")
                                "УТ:Сокращение"("г")
                            }
                            "УТ:Улица" {
                                "УТ:Название"("ЛЕСКОВА")
                                "УТ:Сокращение"("ул")
                            }
                            "УТ:Дом" {
                                "УТ:Номер"(2)
                            }
                        }
                    }
                    "УТ:Подразделение" {
                        "УТ:НаименованиеПодразделения"("НОВОЕ")
                        "УТ:НомерПодразделения"(111)
                    }
                }
                "НПФ:НомерДокументаОрганизации"(333)
                "НПФ:ЗаГод"(2017)
                "НПФ:ТипПериода"("String")
                "НПФ:НомерПериода"(0)
            }
        }
    }
}